# KcalPerS Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..KcalPerS Property
SymbolTypeId Class See Also
---
Symbol kcal/s, indicating unit Kilocalories per second.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId KcalPerS { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KcalPerS As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KcalPerS {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace